# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\exp32\Documents\PSoC Creator\Workspace01\CY8C4147AZI-S475_128KB_L.cydsn\CY8C4147AZI-S475_128KB_L.cyprj
# Date: Thu, 04 May 2023 10:36:40 GMT
#set_units -time ns
create_clock -name {CapSense_1_ModClk(FFB)} -period 5312.5 -waveform {0 2656.25} [list [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {Clock_2(FFB)} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {Clock_1(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_6}]]
create_clock -name {ADC_SAR_Seq_1_intClock(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_18}]]
create_clock -name {UART_3_SCBCLK(FFB)} -period 4333.333333333333 -waveform {0 2166.66666666667} [list [get_pins {ClockBlock/ff_div_1}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {CapSense_1_ModClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 481 961} [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 5 9} [list]
create_generated_clock -name {ADC_SAR_Seq_1_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 49 97} [list]
create_generated_clock -name {UART_3_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 209 417} -nominal_period 4333.333333333333 [list]


# Component constraints for C:\Users\exp32\Documents\PSoC Creator\Workspace01\CY8C4147AZI-S475_128KB_L.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\exp32\Documents\PSoC Creator\Workspace01\CY8C4147AZI-S475_128KB_L.cydsn\CY8C4147AZI-S475_128KB_L.cyprj
# Date: Thu, 04 May 2023 10:36:39 GMT
