# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\exp32\Documents\PSoC Creator\Workspace01\CY8C4146AZI-S455_64KB_R.cydsn\CY8C4146AZI-S455_64KB_R.cyprj
# Date: Sun, 30 Apr 2023 12:27:58 GMT
#set_units -time ns
create_clock -name {CapSense_1_ModClk(FFB)} -period 10625 -waveform {0 5312.5} [list [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {Clock_2(FFB)} -period 20000 -waveform {0 10000} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {Clock_1(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_6}]]
create_clock -name {ADC_SAR_Seq_1_intClock(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_18}]]
create_clock -name {UART_1_SCBCLK(FFB)} -period 4333.333333333333 -waveform {0 2166.66666666667} [list [get_pins {ClockBlock/ff_div_1}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {CapSense_1_ModClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 481 961} [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list]
create_generated_clock -name {ADC_SAR_Seq_1_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 25 49} [list]
create_generated_clock -name {UART_1_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 105 209} -nominal_period 4333.333333333333 [list]


# Component constraints for C:\Users\exp32\Documents\PSoC Creator\Workspace01\CY8C4146AZI-S455_64KB_R.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\exp32\Documents\PSoC Creator\Workspace01\CY8C4146AZI-S455_64KB_R.cydsn\CY8C4146AZI-S455_64KB_R.cyprj
# Date: Sun, 30 Apr 2023 12:27:57 GMT
